Repository: reyemDarnok/MCI_SOSE_2021
Catalog: l10n/app_*.arb
Languages: ar, de, fr

source: Own Events
ar: أحداث خاصة
de: Eigene Events
fr: Mes Événements

source: Settings
ar: الإعدادات
de: Einstellungen
fr: Paramètres

source: FAQ
ar: التعليمات

source: Enter test result
ar: أدخل نتيجة الاختبار
de: Testergebnis eingeben
fr: Entrer le résultat du test

source: Scan QR code
ar: مسح رمز الاستجابة السريعة
de: QR Code scannen
fr: Scannez le code QR

# nameMissingError
source: A name has to be entered
ar: يجب إعطاء اسم.
de: Es muss ein Name angegeben werden
fr: Un nom doit être donné.

# phoneNumberMissingError
source: A telephone number has to be specified
ar: يجب تحديد رقم هاتف.
de: Es muss eine Telefonnummer angegeben werden
fr: Un numéro de téléphone doit être fourni.

# phoneNumberMalformedError
source: This is not a valid telephone number
ar: هذا ليس رقم هاتف صالحًا.
de: Das ist keine valide Telefonnummer
fr: Le numéro de téléphone n'est pas valide.

# streetMissingError
source: A street has to be specified
ar: يجب تحديد شارع.
de: Es muss eine Straße angegeben werden
fr: Enterer l'adresse

# streetMalformedError
source: This is not a valid street
ar: هذا ليس شارعًا صالحًا.
de: Das ist keine valide Straße
fr: L'adresse n'st pas valide

# cityMissingError
source: A street has to be specified
ar: يجب تحديد مدينة.
de: Es muss eine Stadt angegeben werden
fr: Enterer la ville

# cityMalformedError
source: A PLZ and optionally a city name are required
ar: يجب تحديد رمز بريدي واسم مدينة اختياريًا.
de: Es muss eine PLZ und optional ein Stadtname angegeben werden
fr: Un code postal et éventuellement un nom de ville doivent être spécifiés.

source: Add
ar: يضيف
de: Hinzufügen
fr: Ajouter

source: Infection risk:
ar: خطر الإصابة:
de: Infektionsgefahr:
fr: Risque d'infection :

source: High
ar: عالي
de: Hoch
fr: Haute

source: Low
ar: منخفض
de: Niedrig
fr: Faible

source: Enter code
ar: أدخل الرمز
de: Code eingeben
fr: Ajouter le code

source: Positive
ar: إيجابي
de: Positiv
fr: Positif

source: Negative
ar: سلبي
de: Negativ
fr: Negatif

# scanTestQRCode
source: Scan test result QR code
ar: مسح رمز الاستجابة السريعة نتيجة الاختبار
de: Testergebnis QR Code scannen
fr: Scannez le code QR du résultat du test

source: Language
ar: اللغة
de: Sprache
fr: Langue

source: Personal Data
ar: البيانات الشخصية
de: Persönliche Daten
fr: Données personnelles

source: Internal workings
ar: أسلوب العمل الداخلي
de: Interne Arbeitsweise
fr: Mode de fonctionnement interne

# title
source: Corona EventApp
ar: حدث كورونا

# addVisitor
source: {eventName} - Add Visitor
ar: {eventName} - إضافة مشارك
de: {eventName} - Teilnehmer hinzufügen
fr: {eventName} - ajouter des participants

source: New event
ar: حدث جديد
de: Neues Event
fr: Nouvel évènement

# minDurationMissingError
source: A minimum duration has to be specified
ar: يجب تحديد الحد الأدنى للمدة.
de: Es muss eine Mindestdauer angegeben werden
fr: Une durée minimale doit être spécifiée.

# minDurationMalformedError
source: The minimum duration has to be a number
ar: الحد الأدنى للمدة يجب أن يكون رقمًا.
de: Die Mindestdauer muss eine Zahl sein
fr: La durée minimale doit être un nombre.

source: Create new event
ar: إنشاء حدث جديد
de: Neues Event erstellen
fr: Créer un nouvel événement

# minDuration
source: Minimum duration of visit: {minDuration}
ar: الحد الأدنى لوقت المكوث: {minDuration}
de: Minimale Verweildauer: {minDuration}
fr: Temps de séjour minimum : {minDuration}

# manualVisitors
source: Manual visitors: {visitorNum}
ar: يدويون المشاركون: {VisitorNum}
de: Manuelle Teilnehmer: {visitorNum}
fr: Participants manuels : {visitorNum}

# addManualVisitors
source: Add Visitor manually
ar: إضافة مشاركين يدويًا
de: Manuell Teilnehmer hinzufügen
fr: Ajouter des participants manuellement

source: Share QR code
ar: مشاركة رمز الاستجابة السريعة
de: QR Code teilen
fr: Partager le code QR

# name
source: Name: {name}
ar: الاسم: {name}
fr: Le nom: {name}

# phoneNumber
source: Telephone number: {phoneNum}
ar: رقم الهاتف: {phoneNum}
de: Telefonnummer: {phoneNum}
fr: Numéro de téléphone: {phoneNum}

# street
source: Street, number: {street}
ar: الشارع , رقم المنزل: {street}
de: Straße, Hausnummer: {street}
fr: Numéro de rue / maison: {street}

# city
source: PLZ, city: {city}
ar: ZIP, city: {city}
de: PLZ, Stadt: {city}
fr: Code postal / Ville: {city}

source: Manually added visitors
ar: تمت إضافة مشاركين يدويًا
de: Manuell hinzugefügte Teilnehmer
fr: Participants ajoutés manuellement

source: Save
ar: حفظ
de: Speichern
fr: sauver

# sourceCode
source: Source Code (external link)
ar: شفرة المصدر (رابط خارجي)
de: Quellcode (externer Link)
fr: Quellcode (externer Link)

source: Log file
ar: ملف السجل
de: Log Datei
fr: Log Datei

# functionalityNotAvailable
source: This functionality is sadly not supported for this platform
ar: للأسف , هذه الوظيفة غير متوفرة على هذا النظام الأساسي
de: Diese Funktionalität ist auf dieser Plattform leider nicht verfügbar
fr: Malheureusement, cette fonctionnalité n'est pas disponible sur cette plateforme

source: Select language
ar: حدد اللغة
de: Sprache wählen
fr: choisissez votre langue

# shareQRCodeImage
source: Share QR code as picture
ar: مشاركة رمز الاستجابة السريعة كصورة
de: QR Code als Bild teilen
fr: Partager le code QR en tant qu'image

source: Event registered
ar: تم تسجيل الحدث
de: Event registriert
fr: Événement enregistré

# eventInfo
source: Name: {name} Unique Id: {id}
ar: الاسم: {name} المعرف الفريد: {id}
de: Name: {name} Eindeutige Id: {id}
fr: Le nom: {name} Id unique: {id}

# nameLabel
source: Name
ar: الاسم
fr: Le nom

# nameHintText
source: Enter name
ar: أدخل اسمًا
de: Name eingeben
fr: Donner le nom

# minDurationLabel
source: Minimal duration of presence
ar: الحد الأدنى لوقت المكوث
de: Minimale Verweildauer
fr: Durée minimale de séjour

# minDurationHintText
source: Enter minimum duration
ar: أدخل الحد الأدنى لمدة الإقامة
de: Minimale Verweildauer eingeben
fr: Entrez le temps de séjour minimum

source: Unknown QR Code
ar: رمز الاستجابة السريعة غير معروف
de: Unbekannter QR Code
fr: Code QR inconnu

# phoneNumberLabel
source: Telephone number
ar: رقم الهاتف
de: Telefonnummer
fr: Numéro de téléphone

# phoneNumberHintText
source: Enter Telephone number
ar: أدخل رقم الهاتف
de: Telefonnummer eingeben
fr: Enterez Numéro de téléphone

# streetLabel
source: Street and house number
ar: رقم الشارع والمنزل
de: Straße und Hausnummer
fr: Numéro de rue / maison:

# streetHintText
source: Enter Street and house number
ar: أدخل رقم الشارع والمنزل
de: Straße und Hausnummer eingeben
fr: Entrez Numéro de rue / maison:

# cityHintText
source: Enter PLZ and (optionally) the cityname
ar: أدخل الرمز البريدي واسم المدينة (اختياري)
de: PLZ und (optional) Stadtnamen eingeben
fr: Entrez le code postal et (facultatif) le nom de la ville

# estimatedDurationMalformedError
source: Unknown format. Seperator is ',', known Units are d,h,m,s,ms,us
ar: تنسيق غير معروف. الفاصل هو ',' , الوحدات المعروفة هي d , h , m , s
de: Unbekanntes Format. Trennzeichen ist ',', bekannte Einheiten sind d,h,m,s,ms,us
fr: Format inconnu. Le séparateur est ',', les unités connues sont d, h, m, s

source: Confirm
ar: تأكيد
de: Bestätigen
fr: Confirmer

# visitConfirmed
source: Registered participation in event {event}
ar: تم تسجيل المشاركة في الحدث {event}
de: Teilnahme am Event {event} registriert
fr: Participation à l'événement {événement} enregistré

# estimatedDurationLabel
source: Estimated duration of stay
ar: مدة الإقامة المتوقعة
de: Erwartete Verweildauer
fr: Durée prévue du séjour

source: Events
ar: الأحداث
fr: Événements

source: Visited Events
ar: الأحداث التي تمت زيارتها
de: Besuchte Events
fr: Événements visités

# start
source: Start: {start}
ar: البدء: {البدء}
fr: Commencer:{start}

# end
source: End: {end}
ar: Ende: {end}
de: Ende: {end}
fr: La fin: {end}

source: Yes
ar: نعم
de: Ja
fr: Oui

source: No
ar: لا
de: Nein
fr: Non

# confirmSendPositive
source: Really register a positive test result?
ar: هل أنت متأكد من تسجيلك لاختبار إيجابي؟
de: Wirklich einen positiven Test registrieren?
fr: Vraiment enregistrer un test positif?

# confirmSendNegative
source: Really register a negative test result?
ar: هل أنت متأكد من تسجيلك لاختبار سلبي؟
de: Wirklich einen negativen Test registrieren?
fr: Vraiment enregistrer un test négatif?

# informedGovernment
source: Government is informed
ar: الاتصالات على علم
de: Gesundheitsamt ist informiert
fr: les personnes de contact seront informées

# visitorCode
source: Visitor QR code
ar: رمز الاستجابة السريعة للزائر
de: Besucher QR Code
fr: QR code visiteur

# authCode
source: Administrator QR code
ar: رمز الاستجابة السريعة للمسؤول
fr: QR code administrateur

# authorisedTitle
source: Added Event to own Events
ar: تمت إضافة الحدث إلى الأحداث الخاصة
de: Event zu eigenen Events hinzugefügt
fr: Événement ajouté à ses propres événements

# cityLabel
source: City
de: Stadt
fr: Ville
